#include <stdio.h>
#include <stdlib.h>
int main()
{
//============================================================
int **a, n,m;// указатель на массив, размерность массива A
int **b, nb,mb;
int i = 0, j = 0;// индексы элементов матрицы
printf("Input a size of an array: ");
scanf("%d", &n);
scanf("%d", &m);
nb=n;
mb=m;
n=n*3;
m=m*3;
//=============================================================
// выделяем память под массив
a = (int**)malloc(n * sizeof(int*));
 // Ввод элементов массива
  for (i = 0; i<n; i++)  // цикл по строкам
  {
    // Выделение памяти под хранение строк
    a[i] = (int*)malloc(m * sizeof(int));
    for (j = 0; j<m; j++)  // цикл по столбцам
    {
    a[i][j] = rand() % 10 + 1;
    }
  }
//============================================================
 for (i = 0; i < n; i++)  // цикл по строкам
  {
    for (j = 0; j < m; j++)  // цикл по столбцам
    {
      printf("%5d ", a[i][j]); // 5 знакомест под элемент массива
    }
    printf("\n");
  }
//===========================================================
//Из матрицы a размером 3n×3m сформировать матрицу b размером n×m. Каждый элемент bij 
//вычислит как определитель матрицы третьего порядка, составленный из элементов матрицы a, 
//лежащих на пересечении строк (3(i+1)-2), (3(i+1)-1), 3(i+1) и столбцов (3(j+1)-2), (3(j+1)-1), 3(j+1)
//===============================================================
// выделяем память под массив
b = (int**)malloc(nb * sizeof(int*));
 // Ввод элементов массива
  for (i = 0; i<nb; i++)  // цикл по строкам
  {
    // Выделение памяти под хранение строк
    b[i] = (int*)malloc(mb * sizeof(int));
    for (j = 0; j<mb; j++)  // цикл по столбцам
    {
    b[i][j] = a[(3*(i+1)-2)][(3*(j+1)-2)]*a[(3*(i+1)-1)][(3*(i+1)-1)]*a[(3*i)][(3*(j+1))]
    +a[(3*i)][(3*(j+1)-2)]*a[(3*(i+1)-2)][(3*(i+1)-1)]*a[(3*(i+1)-1)][(3*(j+1))]
    +a[(3*(i+1)-1)][(3*(j+1)-2)]*a[(3*i)][(3*(i+1)-1)]*a[(3*(i+1)-2)][(3*(j+1))]
    -(a[(3*i)][(3*(j+1)-2)]*a[(3*(i+1)-1)][(3*(i+1)-1)]*a[(3*(i+1)-2)][(3*(j+1))])
    -(a[(3*(i+1)-2)][(3*(j+1)-2)]*a[(3*i)][(3*(i+1)-1)]*a[(3*(i+1)-1)][(3*(j+1))])
    -(a[(3*(i+1)-1)][(3*(j+1)-2)]*a[(3*(i+1)-2)][(3*(i+1)-1)]*a[(3*i)][(3*(j+1))]);
    }
  }
//============================================================
printf("Матрица после решения: \n");
 for (i = 0; i < nb; i++)  // цикл по строкам
  {
    for (j = 0; j < mb; j++)  // цикл по столбцам
    {
      printf("%5d ", b[i][j]); // 5 знакомест под элемент массива
    }
    printf("\n");
  }
//===============================================================
// Очистка памяти
  for (i = 0; i < n; i++){  // цикл по строкам
    free(a[i]); // освобождение памяти под строку в a
    free(b[i]);} // освобождение памяти под строку в b
  free(a);
  free(b);
  getchar();   getchar();
  return 0;
}